package com.example.andrew.chatsystem;

import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class SqlDatabase extends SQLiteOpenHelper {
    private static String database="Aidsdata";
    SQLiteDatabase aiddatabase;
    String smashing;
    String smashingheaders;
    String Artificialrespiration;
    String Artificialrespirationheaders;
    String sugar;
    String sugarheaders;
    String Unconsciousness;
    String Unconsciousnessheaders;
    String bleeding;
    String bleedingheaders;

    public SqlDatabase (Context context)
    {
        super(context,database,null,5);
        smashing="الكسر هو انقسام او ضرخ في العظم يحدث نتيجة صدمة قوية أو مفاجئة تقع على العظم " +
                "كما في حالات حوادث الطرق أو السقوط/--/احساس المصاب بألم شديد, شكل غير عادي للطرف المكسور, انتفاخ منطقة الاصابة و الاحساس بألالم/ كسور بسيطة (مغلقة):" +

                "و هي الكسور التي يبكسر بها العظم دون أن يسبب جرحا أو تلفا في الجلد مفتوحا للخارج\n" +
                "كسور مضاعفة(مفتوحة):و هي الكسور التي يبرز بها العظم و هي أخطر من الكسور المغلقة لأنه يرافقها خطر حدوث التهاب أو نزيف من الجرح";
        smashingheaders="حالات الكسور/استعن بهذا/أعراض الاصابة/أنواع الكسور";
        Artificialrespiration="هو عملية تنفس ميكانكية لاستعادة وضع الرئتين عند توقف او اضطراب التنفس يجب على  كل انسان تعلم هذا الاجراء فقد يضطر لانقاذ حياة مصاب وانه في حالة توقف التنفس لا يعيش الانسان اكثر من6 دقائق وكلما كان الاسعاف اسرع كلما قل التلف في انسجة المخ بسبب نقص الاكسجين/" +
                "الغرق-الاختناق-الصدمة الكهربائية-الافراط في تناول بعض الادوية وخصوصا المهدئات او المخدرات-النوبة القلبية-اصابة الراس والصدر\n" +
                "وفي التنفس الصناعي يتم نقل الهواء من رئتى المسعف إلى المصاب بالنفخ عن طريق الفم وهذا الزفير يحتوى على 16% من الأكسجين وهو أكثر مما يحتاج إليه للحفاظ على الحياة وهذا من فم لفم\n" +
                "التنفس الصناعى عن طريق الفم للفم هى الطريقة المفضلة فى جميع الحالات التى لا يتنفس فيها المصاب واذا تعذر الفم يمكن استخدام الانف او الفم والانف معا\n" +
                "-\tقياس مدى درجة وعى عند المصاب" +
                "اذا كان المصاب واعيا لما حاوله او يستجيب عند النداء عليه او عند هز كتفه فهذا يعنى ان جهاز التنفس يعمل وان قلبة ينبض فلا داعى لاجراء التنفس الصناعى او انعاش قلبه/" +
                "ولكن يجب ملاحظته باستمرار للتأكد من حفاظه على درجة الوعى والتنفس وعمل القلب الى ان تصل الاسعاف/" +
                "1 امل رأس الشخص الى الوراء بحيث تتجه ذقنه الى اعلى وذلك لابقاء المسالك التنفسيه مفتوحه ويتم تفريغ الفم من كل شئ فيه حتى الاسنان الصناعية \n" +
                "2 باليد اليسرى نغلق فتحتى الانف تماما ونجذب الرأس الى الوراء \n" +
                "3 وباليد اليمنى نبقى الذقن متجها الى اعلى \n" +
                "4 افتح فم المصاب واطبق فمك عليه باحكام \n" +
                "5 خذ زفيرا وانفخه فى فى الماصب بعمق لمده ثانية واحدة او ثانية ونصف ثم توقف عن الزفير لنفس المدة \n" +
                "6 اذا لاحظت ارتفاعا وانخفاضا فى صدر المصاب اثناء العملية النفخ \n" +
                "7 فكرر عملية النفخ مرة اخرى كل خمس ثوانى \n" +
                "8 كل مرتين راقب تنفس المصاب الى حين وصول فرقة الاسعاف المهنى \n" +
                "9 يكون طول النفس فى حالة اعطاء تنفس صناعى للشخص البالغ (اخذ نفس عميق ونفخه) اذا كان المصاب طفل يكون طول النفس (ما هو متواجد فى رئه المسعف ) اما اذا كان رضيعا( نفخه بسيطة )\n" +
                "10 حالمد يستعيد المصاب تنفسه اقلب المصاب فى اتجاهك لوضع المصاب فى وضع الافاقه ولا نتركه وحده باى حال من الاحوال اذا قد يتوقف التنفس مرة اخرى\n" +
                "11 انا فى حال لا يوجد علو فى صدر المصاب اثناء النفخ هذا يعنى ان هناك انسداد فى مجرى الهواء ادخل اصبعك  فى الفم لاستخراج ما قد يكون مسببا لذلك ثم تابع عملية الانعاش/--/" +
                "بعد ذلك تفحص نبض الشخص عن طريق جس اعلى عنقه حيث بوضع السبابه والوسطى على رقبة المصاب من اليمين او من اليسار\n" +
                "•فاذا لم تتحسن نبض المصاب فيجب التحول فورا الى طريق عملية الاتعاش القلبى الرئوى\n";
        Artificialrespirationheaders="التنفس الاصطناعى/الاسباب المؤدية لتوقف التنفس:/الاسعافات الاولية/طريقة التنفس الصناعى /طريقة ملاحظه النبض ";
        sugar="وهى حالة يفقد فيها الانسان وعيهنتيجة ارتفاع مستوى السكرفي دمه؛ويكون سببها الرئيسى هو اهمال علاج مرض السكر \n" +
                "وينصح  الاطباء المريض بتنظيم علاج السكر والالتزام بالحمية في الوجبات الغذائية لعدم تكرار مثل هذه الغيبوبة بالمستقبل/تحدث دائما مع الاستعمال السيء لادواية المخفضة للسكر مع اهمال الوجبات؛مما يؤدى الى انخفاض نسبة مستوى السكر في الدم مؤديا الى غيبوبة لان المخ  تعود على نسبة عالية من السكر .\n" +
                "وينصح الاطباء في مثل هذه الحالة بنتاول مادة سكرية مثل قوالب السكر مع الاستعمال السليم للانسولين واقراص العلاج ؛وعدم اهمال الوجبات اليومية حتى لا تتكرر مثل هذه الغيبوبة.\n" +
                "والتى تعتبر اخطر لانها قد تؤثر على خلايا المخ(اذا استمرت اكثر من24 ساعة )/" +
                "اولا:ارتفاع مستوى السكر في الدم:\n" +
                "1.\tغيبوبة وفقدان بطيء للوعى \n" +
                "2.\tجفاف ودفء الجلد\n" +
                "3.\tسرعة التنفس\n" +
                "4.\tعطش شديد ورائحة مثل الفواكه تصدر من الفم مع جفاف للسان\n" +
                "5.\tضعف وسرعة النبض (اكثرمن100 نبضة بالدقيقة)/" +
                "1.\tغيبوبة وفقدان سريع للوعى\n" +
                "2.\tرطوبة وشحوب للون في الجلد\n" +
                "3.\tسرعة التنفس\n" +
                "4.\tرطوبة الفم واللسان مع وجود رائحته الطبيعية \n" +
                "5.\tضعف وسرعة النبض\n" +
                "6.\tرعشة باليدين مع الارهاق والتعب الشديد\n" +
                "•\tاذا كان يعانى المريض بغيبوبة ممن النوع الاول ارتفاع مستوى السكر فقم بحقنه بالانسولين على الفور\n" +
                "•\tاما اذا كان من النوع الثانى انخفاض لمستوى السكر فقم باعطائه اى محلول اومادة او عصائر بها سكر على الفور/" +
                "قم على الفولر بانقاذ المريض على اعتبار انه انخفاض في مستوى السكر لانها اكثر خطورة على حياته/" +
                "1.\tقم باعطائه اى محلول سكرى او عصائر عن طريق الفم.\n" +
                "2.\tاتصل بالاسعاف فورا.\n" +
                "1.\tلاتعطه اى شئ عن طريق الفم.\n" +
                "2.\tقم بفتح مجرى الهواء وافحص التنفس.\n" +
                "3.\tاذان كان يتنفس وتحس بنبضه فقم بوضعه في وضعية الافاقة.\n" +
                "4.\tاما اذا كان لا يتنفس وتحس بنبضهفقم باجراء التنفس الصناعى.\n" +
                "5.\tاذا كان لايتنفس ولا تحس بنبضه فقم باجراء تدليك القلب.\n" +
                "6.\tاتصل بالاسعاف فورا\n" +
                "ملحوظة هامة: مريض السكرى الذى يعتمد في علاجه على الانسولين يجب ان يتناول طعامه بعد الحقن مباشرة .";
        sugarheaders="غيبوبة ارتفاع مستوى السكر في الدم (محتاج انسولين)/غيبوبة انخفاض مستوى السكر في الدم (محتاج سكر)/الاعراض العامة:/الاسعافات الاولية:/ماذا افعل اذا لم اتمكن من تحديد سبب الغيبوبة ؟/كيف اتصرف؟/";
        Unconsciousness="الاغماء هو فقدان الوعى لفترة وجيزة سببها قلة تدفق الدم الى الماغ مباشرة/1. اضطراب فى السلوك\n" +
                "2. فقدان الوعى مؤقتا وممكن ان يقع المصاب \n" +
                "3. نبض بطئ \n" +
                "4. بشرة شابحة/" +
                "1.\t1 ساعد المصاب  على الاستلقاء على ظهرة (تجنب وضع الجلوس أو الوقوف )\n" +
                "2.\t2 تأكد من وجود التهوية اللازمة \n" +
                "3.\t3 ارفع ساقى المصاب الى اعلى 30 سم  (12 بوصة) اذا كان المصاب لايعانى من اى مشكلة فى التنفس وان لم يكن هناك ما يمنع ذلك (كما فى حالة الكسور مثلا ) ورفع الساقين يكون بوضع مخدة او صندوق مثلا تحت كعب المصاب ارفع ساقيه ( لاتضع المخدة  تحت الساق او تحت الركبة)\n" +
                "4.\t4  فك او حل الملابس الضيقة عن المصاب \n" +
                "5.\t5 لا تعطى اى شئ عن طريق الفم وهو مغمى عليه \n" +
                "6.\t6 اذا تقيأ تلمصاب ضعه على جانبة وأدر رأسه جانبا و امسح القئ من فمه \n" +
                "7.\t7 لا تصب الماء او اى سائل اخر على وجه المصاب بل يمكن ان تمسح وجهه بفوطة مبلولة بالماء البارد \n" +
                "8.\t8 اذا ما بدأ المصاب يعى ما حوله فطمئنه وساعده على الجلوس \n" +
                "9.\t9 فحص المصاب وتاكد من خلوه من الجروح او الكسور الواضحة والتى قد تكون خلال سقوطه بعد فقدانه الوعى \n" +
                "10.\t10 راقب المصاب بعد افاقته وانتبه الى فقدان الوعى لمده قصيرة ثم الافاقة قد يتبعه  فقدان للوعى مرة اخرى ولمدة طويلة هذة المرة وهنا يستحسن استداعاء الاسعاف\n";
        Unconsciousnessheaders="حالات الاغماء /الاعراض والاعلامات العامة /الاسعافات الاولية";
        bleeding="النزيف هو خروج الدم من الاوعية الدموية قليلا او كثيرا يسمى خارجيا اذا كان خارج الجسم ويسمى داخليا اذا كان فى احد تجاويف الجسم المحتلفة/" +
                "- النزيف الشريانى وهو اشد خطرا ويكون لون الجم فيه احمر فاتح ويخرج بغزارة ويكون متقطعا مع ضربات القلب وباندفاع قوى\n" +
                "-النزيف الوريدى وهو يخرج فى تيار بطئ ويكون لون الدم احمر غامق لتشبعة بثانى اكسيد الكربون\n" +
                "-النزيف الشعرى وهو اقل خطرا وبخرج بانسياب بطئ ويكون لون الدم احمر ارجوانى وفد يظهر على هيئة نقط دموية صغير\n" +
                "-النزيف الداخلى وهو اما يكون تحت الجلد او يكون محتبئا داخل الاعضاء او احد تجاويغ الجسم المختلفة مثل نزيف الجمجمة وغيرها/ \n" +
                "1.\t خروج الدم اذا كان الجرح مفتوحا \n" +
                "2.\t ظهور ورم دموى فى مكان الاصابة \n" +
                "3.\t برودة فى الجسم -تعرق الجسم\n" +
                "4.\t سرعة معدل التنفس مصحوبة بشهيق\n" +
                "5.\t /سرعة النبض - العطش الشديد\n" +
                "•\tالضغط المباشر على الجرح النازف بغيار نظيف \n" +
                "•\tرفع العضو المصاب الى اعلى ان لم يكن به كسر \n" +
                "•\tيربط الضمادة جيدا بينما يظل العضو مرفوعا\n" +
                "•\tقد يصبح الغيار مشبعا بالدم فلا تغيره ابدا ولا تنزعه\n" +
                "•\tيمكن وضع غيار ثانى مشبعا بالدم فلا تغيره ابدا ولا تنزعة\n" +
                "•\tمراقبة المصاب من حدوث الصدمة \n" +
                "•\tينقل المصاب الى اقرب مركز طبى \n" +
                "•\t/--/لا تستخدم البن او ما شابه لايقاف النزيف\n" +
                "•\t اذا كانت الاصابه بسيطة ضع عليها ثلجا او كماده باردة للمساعدة فى تخفيف الالم والتورم وضع قطعة قماش بين الثلج وجلد المصاب لمنغ تلف الجلد\n" +
                "•\tاجعل المصاب يستلقى على جانبه متكئا على احدى يديه ويثنى ركبتيه للمساعدة فى خروج القئ ان وجد \n" +
                "•\tحافظ على درجة حرارة الجسم الطبيعية بتغطية المصاب\n" +
                "•\tكما يجب تهدئة المصاب وبعث الطمأنينة فى نفسه \n" +
                "•\tلا تقدم للمصاب اى طعام او شراب \n" +
                "•\tاذا كان فاقدا للوعى افحص التنفس وذا لزم الامر انعش تنفسه\n";
        bleedingheaders="حالات النزيف/انواع النزيف/الاعراض والعلامات العامة/ايقاف النزيف الخارجى/الاسعاف الاولى للنزيف الداخلى ";
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL("create table if not exists Aids(Aidid text primary key ,aidtext text not null,aidheaders text not null ,aidphotos text)");

        db.execSQL("insert into Aids (Aidid,aidtext,aidheaders,aidphotos) values('smashing','"+smashing+"','"+smashingheaders+"','0,2')");
        db.execSQL("insert into Aids (Aidid,aidtext,aidheaders,aidphotos) values('Artificialrespiration','"+Artificialrespiration+"','"+Artificialrespirationheaders+"','3')");
        db.execSQL("insert into Aids (Aidid,aidtext,aidheaders,aidphotos) values('sugar','"+sugar+"','"+sugarheaders+"','')");
        db.execSQL("insert into Aids (Aidid,aidtext,aidheaders,aidphotos) values('Unconsciousness','"+Unconsciousness+"','"+Unconsciousnessheaders+"','')");
        db.execSQL("insert into Aids (Aidid,aidtext,aidheaders,aidphotos) values('bleeding','"+bleeding+"','"+bleedingheaders+"','1')");



    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("drop table if exists Aids");
        onCreate(db);
    }
    public Cursor getinfo(String aidid)
    {
        aiddatabase=getReadableDatabase();
        Cursor cur=aiddatabase.rawQuery("select aidtext,aidheaders,aidphotos from Aids where Aidid=? ",new String[]{aidid});
        if(cur!=null)
            cur.moveToFirst();
        aiddatabase.close();
        return cur;

    }
}
